def z1():
    a = [1,5,3,6,2]
    b = int(input('Введите число: '))
    if b in a:
        print(a, "Поздравляю, Вы угадали число!")
    else:
        print(a, "Нет такого числа!")
def z2():
    a = [1, 5, 6, 8, 4, 5, 9, 0]
    mn = set()
    for x in a:
        if x in mn:
            print("Найдено повторяющееся значение: ", x)
        mn.add(x)
def z3():
    week = ('Понедельник', 'Вторник', 'Среда', 'Четверг', 'Пятница', 'Суббота', 'Воскресенье')
    a = int(input('Сколько выходных дней на неделе вы хотите? '))
    hol = list(week[-a:])
    work = list(week[:-a])
    print("Ваши выходные дни:", ", ".join(hol))
    print("Ваши рабочие дни:", ", ".join(work))

def z4():
    md25 = ["Токарева", "Поспелова", "Анисимов", "Овчинников", "Бречалова", "Орел", "Гусева", "Куприн", "Зотова", "Идрисова"]
    md20 = ["Семенов", "Белкина", "Иванов", "Федорова", "Желтухина", "Сюсюра", "Захарова", "Петров", "Бойцев", "Доненко"]
    team = tuple(md25[:5] + md20[:5])
    print("Список группы 1-мд-25: ", md25)
    print("Список группы 1-мд-20: ", md20)
    print("Список команды: ", team)
    print("Длина: ", len(team))
    print("Отсортированный список: ", sorted(team))
    if "Иванов" in team:
        a = team.count("Иванов")
        if a > 0:
            print("Студент Иванов входит в команду", a, "раз")
        print("Студент Иванов не входит в команду")
z4()